// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным

int number = 0;

if (number % 2 == 0)
{
    Console.WriteLine("Число чётное");
}
else
{
    Console.WriteLine("Число нечётное");
}